zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxLmu_bf.h
/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN34 */
#define IFX_LMU_ACCEN1_EN34_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN34 */
#define IFX_LMU_ACCEN1_EN34_OFF (2u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN35 */
#define IFX_LMU_ACCEN1_EN35_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN35 */
#define IFX_LMU_ACCEN1_EN35_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN35 */
#define IFX_LMU_ACCEN1_EN35_OFF (3u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN36 */
#define IFX_LMU_ACCEN1_EN36_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN36 */
#define IFX_LMU_ACCEN1_EN36_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN36 */
#define IFX_LMU_ACCEN1_EN36_OFF (4u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN37 */
#define IFX_LMU_ACCEN1_EN37_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN37 */
#define IFX_LMU_ACCEN1_EN37_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN37 */
#define IFX_LMU_ACCEN1_EN37_OFF (5u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN38 */
#define IFX_LMU_ACCEN1_EN38_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN38 */
#define IFX_LMU_ACCEN1_EN38_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN38 */
#define IFX_LMU_ACCEN1_EN38_OFF (6u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN39 */
#define IFX_LMU_ACCEN1_EN39_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN39 */
#define IFX_LMU_ACCEN1_EN39_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN39 */
#define IFX_LMU_ACCEN1_EN39_OFF (7u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN40 */
#define IFX_LMU_ACCEN1_EN40_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN40 */
#define IFX_LMU_ACCEN1_EN40_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN40 */
#define IFX_LMU_ACCEN1_EN40_OFF (8u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN41 */
#define IFX_LMU_ACCEN1_EN41_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN41 */
#define IFX_LMU_ACCEN1_EN41_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN41 */
#define IFX_LMU_ACCEN1_EN41_OFF (9u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN42 */
#define IFX_LMU_ACCEN1_EN42_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN42 */
#define IFX_LMU_ACCEN1_EN42_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN42 */
#define IFX_LMU_ACCEN1_EN42_OFF (10u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN43 */
#define IFX_LMU_ACCEN1_EN43_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN43 */
#define IFX_LMU_ACCEN1_EN43_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN43 */
#define IFX_LMU_ACCEN1_EN43_OFF (11u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN44 */
#define IFX_LMU_ACCEN1_EN44_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN44 */
#define IFX_LMU_ACCEN1_EN44_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN44 */
#define IFX_LMU_ACCEN1_EN44_OFF (12u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN45 */
#define IFX_LMU_ACCEN1_EN45_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN45 */
#define IFX_LMU_ACCEN1_EN45_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN45 */
#define IFX_LMU_ACCEN1_EN45_OFF (13u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN46 */
#define IFX_LMU_ACCEN1_EN46_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN46 */
#define IFX_LMU_ACCEN1_EN46_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN46 */
#define IFX_LMU_ACCEN1_EN46_OFF (14u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN47 */
#define IFX_LMU_ACCEN1_EN47_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN47 */
#define IFX_LMU_ACCEN1_EN47_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN47 */
#define IFX_LMU_ACCEN1_EN47_OFF (15u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN48 */
#define IFX_LMU_ACCEN1_EN48_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN48 */
#define IFX_LMU_ACCEN1_EN48_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN48 */
#define IFX_LMU_ACCEN1_EN48_OFF (16u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN49 */
#define IFX_LMU_ACCEN1_EN49_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN49 */
#define IFX_LMU_ACCEN1_EN49_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN49 */
#define IFX_LMU_ACCEN1_EN49_OFF (17u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN50 */
#define IFX_LMU_ACCEN1_EN50_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN50 */
#define IFX_LMU_ACCEN1_EN50_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN50 */
#define IFX_LMU_ACCEN1_EN50_OFF (18u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN51 */
#define IFX_LMU_ACCEN1_EN51_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN51 */
#define IFX_LMU_ACCEN1_EN51_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN51 */
#define IFX_LMU_ACCEN1_EN51_OFF (19u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN52 */
#define IFX_LMU_ACCEN1_EN52_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN52 */
#define IFX_LMU_ACCEN1_EN52_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN52 */
#define IFX_LMU_ACCEN1_EN52_OFF (20u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN53 */
#define IFX_LMU_ACCEN1_EN53_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN53 */
#define IFX_LMU_ACCEN1_EN53_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN53 */
#define IFX_LMU_ACCEN1_EN53_OFF (21u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN54 */
#define IFX_LMU_ACCEN1_EN54_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN54 */
#define IFX_LMU_ACCEN1_EN54_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN54 */
#define IFX_LMU_ACCEN1_EN54_OFF (22u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN55 */
#define IFX_LMU_ACCEN1_EN55_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN55 */
#define IFX_LMU_ACCEN1_EN55_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN55 */
#define IFX_LMU_ACCEN1_EN55_OFF (23u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN56 */
#define IFX_LMU_ACCEN1_EN56_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN56 */
#define IFX_LMU_ACCEN1_EN56_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN56 */
#define IFX_LMU_ACCEN1_EN56_OFF (24u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN57 */
#define IFX_LMU_ACCEN1_EN57_LEN (1u)

/** \brief Mask for Ifx_LMU_ACCEN1_Bits.EN57 */
#define IFX_LMU_ACCEN1_EN57_MSK (0x1u)

/** \brief Offset for Ifx_LMU_ACCEN1_Bits.EN57 */
#define IFX_LMU_ACCEN1_EN57_OFF (25u)

/** \brief Length for Ifx_LMU_ACCEN1_Bits.EN58 */
#define IFX_LMU_ACCEN1_EN58_LEN (1u)

