zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxLmu_bf.h
/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN27 */
#define IFX_LMU_RGNACCEN_RA_EN27_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN27 */
#define IFX_LMU_RGNACCEN_RA_EN27_OFF (27u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN28 */
#define IFX_LMU_RGNACCEN_RA_EN28_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN28 */
#define IFX_LMU_RGNACCEN_RA_EN28_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN28 */
#define IFX_LMU_RGNACCEN_RA_EN28_OFF (28u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN29 */
#define IFX_LMU_RGNACCEN_RA_EN29_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN29 */
#define IFX_LMU_RGNACCEN_RA_EN29_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN29 */
#define IFX_LMU_RGNACCEN_RA_EN29_OFF (29u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN30 */
#define IFX_LMU_RGNACCEN_RA_EN30_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN30 */
#define IFX_LMU_RGNACCEN_RA_EN30_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN30 */
#define IFX_LMU_RGNACCEN_RA_EN30_OFF (30u)

/** \brief Length for Ifx_LMU_RGNACCEN_RA_Bits.EN31 */
#define IFX_LMU_RGNACCEN_RA_EN31_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RA_Bits.EN31 */
#define IFX_LMU_RGNACCEN_RA_EN31_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RA_Bits.EN31 */
#define IFX_LMU_RGNACCEN_RA_EN31_OFF (31u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN32 */
#define IFX_LMU_RGNACCEN_RB_EN32_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN32 */
#define IFX_LMU_RGNACCEN_RB_EN32_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN32 */
#define IFX_LMU_RGNACCEN_RB_EN32_OFF (0u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN33 */
#define IFX_LMU_RGNACCEN_RB_EN33_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN33 */
#define IFX_LMU_RGNACCEN_RB_EN33_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN33 */
#define IFX_LMU_RGNACCEN_RB_EN33_OFF (1u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN34 */
#define IFX_LMU_RGNACCEN_RB_EN34_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN34 */
#define IFX_LMU_RGNACCEN_RB_EN34_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN34 */
#define IFX_LMU_RGNACCEN_RB_EN34_OFF (2u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN35 */
#define IFX_LMU_RGNACCEN_RB_EN35_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN35 */
#define IFX_LMU_RGNACCEN_RB_EN35_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN35 */
#define IFX_LMU_RGNACCEN_RB_EN35_OFF (3u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN36 */
#define IFX_LMU_RGNACCEN_RB_EN36_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN36 */
#define IFX_LMU_RGNACCEN_RB_EN36_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN36 */
#define IFX_LMU_RGNACCEN_RB_EN36_OFF (4u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN37 */
#define IFX_LMU_RGNACCEN_RB_EN37_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN37 */
#define IFX_LMU_RGNACCEN_RB_EN37_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN37 */
#define IFX_LMU_RGNACCEN_RB_EN37_OFF (5u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN38 */
#define IFX_LMU_RGNACCEN_RB_EN38_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN38 */
#define IFX_LMU_RGNACCEN_RB_EN38_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN38 */
#define IFX_LMU_RGNACCEN_RB_EN38_OFF (6u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN39 */
#define IFX_LMU_RGNACCEN_RB_EN39_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN39 */
#define IFX_LMU_RGNACCEN_RB_EN39_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN39 */
#define IFX_LMU_RGNACCEN_RB_EN39_OFF (7u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN40 */
#define IFX_LMU_RGNACCEN_RB_EN40_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN40 */
#define IFX_LMU_RGNACCEN_RB_EN40_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN40 */
#define IFX_LMU_RGNACCEN_RB_EN40_OFF (8u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN41 */
#define IFX_LMU_RGNACCEN_RB_EN41_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN41 */
#define IFX_LMU_RGNACCEN_RB_EN41_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN41 */
#define IFX_LMU_RGNACCEN_RB_EN41_OFF (9u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN42 */
#define IFX_LMU_RGNACCEN_RB_EN42_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN42 */
#define IFX_LMU_RGNACCEN_RB_EN42_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN42 */
#define IFX_LMU_RGNACCEN_RB_EN42_OFF (10u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN43 */
#define IFX_LMU_RGNACCEN_RB_EN43_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN43 */
#define IFX_LMU_RGNACCEN_RB_EN43_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN43 */
#define IFX_LMU_RGNACCEN_RB_EN43_OFF (11u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN44 */
#define IFX_LMU_RGNACCEN_RB_EN44_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN44 */
#define IFX_LMU_RGNACCEN_RB_EN44_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN44 */
#define IFX_LMU_RGNACCEN_RB_EN44_OFF (12u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN45 */
#define IFX_LMU_RGNACCEN_RB_EN45_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN45 */
#define IFX_LMU_RGNACCEN_RB_EN45_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN45 */
#define IFX_LMU_RGNACCEN_RB_EN45_OFF (13u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN46 */
#define IFX_LMU_RGNACCEN_RB_EN46_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN46 */
#define IFX_LMU_RGNACCEN_RB_EN46_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN46 */
#define IFX_LMU_RGNACCEN_RB_EN46_OFF (14u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN47 */
#define IFX_LMU_RGNACCEN_RB_EN47_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN47 */
#define IFX_LMU_RGNACCEN_RB_EN47_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN47 */
#define IFX_LMU_RGNACCEN_RB_EN47_OFF (15u)

/** \brief Length for Ifx_LMU_RGNACCEN_RB_Bits.EN48 */
#define IFX_LMU_RGNACCEN_RB_EN48_LEN (1u)

/** \brief Mask for Ifx_LMU_RGNACCEN_RB_Bits.EN48 */
#define IFX_LMU_RGNACCEN_RB_EN48_MSK (0x1u)

/** \brief Offset for Ifx_LMU_RGNACCEN_RB_Bits.EN48 */
#define IFX_LMU_RGNACCEN_RB_EN48_OFF (16u)

